{"container_type": "Author", "filled": ["basics", "publications", "indices", "counts"], "scholar_id": "qG5_O40AAAAJ", "source": "AUTHOR_PROFILE_PAGE", "name": "Hanrong Zhang", "url_picture": "https://scholar.googleusercontent.com/citations?view_op=view_photo&user=qG5_O40AAAAJ&citpid=7", "affiliation": "CS PhD Student, University of Illinois Chicago", "organization": 11791485865926274692, "interests": ["LLM Agent", "AI Safety", "Machine Learning", "Data Mining"], "email_domain": "@uic.edu", "homepage": "https://zhang-henry.github.io/", "citedby": 238, "publications": {"qG5_O40AAAAJ:hqOjcs7Dif8C": {"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "Agent security bench (asb): Formalizing and benchmarking attacks and defenses in llm-based agents", "pub_year": 2025, "citation": "Proceedings of the Thirteenth International Conference on Learning …, 2025", "author": "Hanrong Zhang and Jingyuan Huang and Kai Mei and Yifei Yao and Zhenting Wang and Chenlu Zhan and Hongwei Wang and Yongfeng Zhang", "journal": "Proceedings of the Thirteenth International Conference on Learning Representations (ICLR 2025), 2025.", "abstract": "Although LLM-based agents, powered by Large Language Models (LLMs), can use external tools and memory mechanisms to solve complex real-world tasks, they may also introduce critical security vulnerabilities. However, the existing literature does not comprehensively evaluate attacks and defenses against LLM-based agents. To address this, we introduce Agent Security Bench (ASB), a comprehensive framework designed to formalize, benchmark, and evaluate the attacks and defenses of LLM-based agents, including 10 scenarios (e.g., e-commerce, autonomous driving, finance), 10 agents targeting the scenarios, over 400 tools, 27 different types of attack/defense methods, and 7 evaluation metrics. Based on ASB, we benchmark 10 prompt injection attacks, a memory poisoning attack, a novel Plan-of-Thought backdoor attack, 4 mixed attacks, and 11 corresponding defenses across 13 LLM backbones. Our benchmark results reveal critical vulnerabilities in different stages of agent operation, including system prompt, user prompt handling, tool usage, and memory retrieval, with the highest average attack success rate of 84.30\\%, but limited effectiveness shown in current defenses, unveiling important works to be done in terms of agent security for the community. We also introduce a new metric to evaluate the agents' capability to balance utility and security. Our code can be found at https://github.com/agiresearch/ASB."}, "filled": true, "author_pub_id": "qG5_O40AAAAJ:hqOjcs7Dif8C", "num_citations": 133, "citedby_url": "/scholar?hl=en&cites=15388441744754577176", "cites_id": ["15388441744754577176"], "pub_url": "https://arxiv.org/abs/2410.02644", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:GI_jQjy6jtUJ:scholar.google.com/", "cites_per_year": {"2024": 7, "2025": 100, "2026": 26}}, "qG5_O40AAAAJ:3fE2CSJIrl8C": {"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "Class Incremental Fault Diagnosis under Limited Fault Data via Supervised Contrastive Knowledge Distillation", "pub_year": 2025, "citation": "IEEE Transactions on Industrial Informatics, 2025", "author": "Hanrong Zhang and Yifei Yao and Zixuan Wang and Jiayuan Su and Mengxuan Li and Peng Peng and Hongwei Wang", "journal": "IEEE Transactions on Industrial Informatics", "abstract": "Class-incremental fault diagnosis requires a model to adapt to new fault classes while retaining previous knowledge. However, limited research exists for imbalanced and long-tailed data. Extracting discriminative features from few-shot fault data is challenging, and adding new fault classes often demands costly model retraining. Moreover, incremental training of existing methods risks catastrophic forgetting, and severe class imbalance can bias the model's decisions toward normal classes. To tackle these issues, we introduce a supervised contrastive knowledge distillation for class incremental fault diagnosis (SCLIFD) framework proposing supervised contrastive knowledge distillation for improved representation learning capability and less forgetting, a novel prioritized exemplar selection method for sample replay to alleviate catastrophic forgetting, and the random forest classifier to address the class imbalance …"}, "filled": true, "author_pub_id": "qG5_O40AAAAJ:3fE2CSJIrl8C", "num_citations": 24, "citedby_url": "/scholar?hl=en&cites=12134879703666650349,11790233752263737124", "cites_id": ["12134879703666650349", "11790233752263737124"], "pub_url": "https://ieeexplore.ieee.org/abstract/document/10922759/", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:7ewlEczAZ6gJ:scholar.google.com/", "cites_per_year": {"2023": 1, "2024": 6, "2025": 10, "2026": 7}}, "qG5_O40AAAAJ:qjMakFHDy7sC": {"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "Debiasing Medical Visual Question Answering via Counterfactual Training", "pub_year": 2023, "citation": "MICCAI, 382-393, 2023", "author": "Chenlu Zhan and Peng Peng and Hanrong Zhang and Haiyue Sun and Chunnan Shang and Tao Chen and Hongsen Wang and Gaoang Wang and Hongwei Wang", "pages": "382-393", "publisher": "Springer Nature Switzerland", "abstract": "Medical Visual Question Answering (Med-VQA) is expected to predict a convincing answer with the given medical image and clinical question, aiming to assist clinical decision-making. While today’s works have intention to rely on the superficial linguistic correlations as a shortcut, which may generate emergent dissatisfactory clinic answers. In this paper, we propose a novel DeBiasing Med-VQA model with CounterFactual training (DeBCF) to overcome language priors comprehensively. Specifically, we generate counterfactual samples by masking crucial keywords and assigning irrelevant labels, which implicitly promotes the sensitivity of the model to the semantic words and visual objects for bias-weaken. Furthermore, to explicitly prevent the cheating linguistic correlations, we formulate the language prior into counterfactual causal effects and eliminate it from the total effect on the generated answers. Additionally …"}, "filled": true, "author_pub_id": "qG5_O40AAAAJ:qjMakFHDy7sC", "num_citations": 17, "citedby_url": "/scholar?hl=en&cites=17901796428895691047", "cites_id": ["17901796428895691047"], "pub_url": "https://link.springer.com/chapter/10.1007/978-3-031-43895-0_36", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:JyGvGQH1b_gJ:scholar.google.com/", "cites_per_year": {"2024": 4, "2025": 12, "2026": 1}}, "qG5_O40AAAAJ:d1gkVwhDpl0C": {"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "SAKA: an intelligent platform for semi-automated knowledge graph construction and application", "pub_year": 2023, "citation": "Service Oriented Computing and Applications 17 (3), 201-212, 2023", "author": "Hanrong Zhang and Xinyue Wang and Jiabao Pan and Hongwei Wang", "journal": "Service Oriented Computing and Applications", "volume": "17", "number": "3", "pages": "201-212", "publisher": "Springer London", "abstract": "Knowledge graph (KG) technology is extensively utilized in many areas, and many companies offer applications based on KG. Nonetheless, the majority of KG platforms necessitate expertise and tremendous time and effort of users to construct KG records manually, which poses great difficulties for ordinary people to use. Additionally, audio data are abundant and hold valuable information, but it is challenging to transform it into a KG. What’s more, the platforms usually do not leverage the full potential of the KGs constructed by users. In this paper, we propose an intelligent and user-friendly platform for Semi-automated KG Construction and Application (SAKA) to address the problems aforementioned. Primarily, users can semi-automatically construct KGs from structured data of numerous areas by interacting with the platform, based on which multi-versions of KG can be stored, viewed, managed, and updated …"}, "filled": true, "author_pub_id": "qG5_O40AAAAJ:d1gkVwhDpl0C", "num_citations": 16, "citedby_url": "/scholar?hl=en&cites=18227665524698015915", "cites_id": ["18227665524698015915"], "pub_url": "https://link.springer.com/article/10.1007/s11761-023-00371-x", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:q2hCbDit9fwJ:scholar.google.com/", "cites_per_year": {"2023": 3, "2024": 10, "2025": 2, "2026": 1}}, "qG5_O40AAAAJ:ULOm3_A8WrAC": {"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "Imbalanced chemical process fault diagnosis using balancing GAN with active sample selection", "pub_year": 2023, "citation": "IEEE Sensors Journal 23 (13), 14826-14833, 2023", "author": "Peng Peng and Hanrong Zhang and Xinyue Wang and Wanqiu Huang and Hongwei Wang", "journal": "IEEE Sensors Journal", "volume": "23", "number": "13", "pages": "14826-14833", "publisher": "IEEE", "abstract": "Current deep-learning-based fault diagnosis methods, though proven to be successful with sufficient fault data, cannot well address the challenges of sample availability in real-world industrial scenarios. To address this challenge, this article proposes an effective approach by exploiting data generation and sample selection techniques. Specifically, we first develop a balancing generative adversarial network (BAGAN)-based data generation technique to generate more discriminative fault samples by utilizing not only the fault samples, but also the normal samples. Second, a strategy is devised to select the samples generated by BAGAN, and on this basis, active learning (AL) is utilized to select the most informative samples. The stacked autoencoder (SAE)-based deep neural network (DNN) is used to classify the faults. The proposed method is evaluated by conducting computational experiments on the Tennessee …"}, "filled": true, "author_pub_id": "qG5_O40AAAAJ:ULOm3_A8WrAC", "num_citations": 16, "citedby_url": "/scholar?hl=en&cites=1830878196452061397", "cites_id": ["1830878196452061397"], "pub_url": "https://ieeexplore.ieee.org/abstract/document/10114639/", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:1XCI7gSWaBkJ:scholar.google.com/", "cites_per_year": {"2023": 1, "2024": 7, "2025": 6, "2026": 2}}, "qG5_O40AAAAJ:4TOpqqG69KYC": {"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "Generalized Out-of-Distribution Fault Diagnosis (GOOFD) via Internal Contrastive Learning", "pub_year": 2024, "citation": "IEEE Transactions on Industrial Informatics, 2024", "author": "Xingyue Wang and Hanrong Zhang and Xinlong Qiao and Ke Ma and Shuting Tao and Peng Peng and Hongwei Wang", "journal": "IEEE Transactions on Industrial Informatics", "publisher": "IEEE", "abstract": "Fault diagnosis is crucial in monitoring machines within industrial processes. With the increasing complexity of working conditions and demand for safety during production, diverse diagnosis methods are required, and an integrated fault diagnosis system capable of handling multiple tasks is highly desired. However, the diagnosis subtasks are often studied separately, and the current methods still need improvement for such a generalized system. To address this issue, we propose the generalized out-of-distribution fault diagnosis (GOOFD) framework to integrate diagnosis subtasks. Additionally, a unified fault diagnosis method based on internal contrastive learning and Mahalanobis distance is put forward to underpin the proposed generalized framework. The method involves feature extraction through internal contrastive learning and outlier recognition based on the Mahalanobis distance. Our proposed method …"}, "filled": true, "author_pub_id": "qG5_O40AAAAJ:4TOpqqG69KYC", "num_citations": 14, "citedby_url": "/scholar?hl=en&cites=3502423006933586309,12519087565759118646", "cites_id": ["3502423006933586309", "12519087565759118646"], "pub_url": "https://ieeexplore.ieee.org/abstract/document/10510599/", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:hZFuDSsbmzAJ:scholar.google.com/", "cites_per_year": {"2024": 2, "2025": 8, "2026": 4}}, "qG5_O40AAAAJ:2osOgNQ5qMEC": {"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "Multi-gate Mixture-of-Expert Combined with Synthetic Minority Over-sampling Technique for Multimode Imbalanced Fault Diagnosis", "pub_year": 2023, "citation": "2023 26th International Conference on Computer Supported Cooperative Work in …, 2023", "author": "Wanqiu Huang and Hanrong Zhang and Peng Peng and Hongwei Wang", "conference": "2023 26th International Conference on Computer Supported Cooperative Work in Design (CSCWD)", "pages": "456-461", "publisher": "IEEE", "abstract": "Compared with traditional multivariate statistical techniques, deep neural networks have been frequently used for single-mode fault diagnosis and have shown promising results. However, in the real world, a complex industrial process may have several modes and fewer fault samples than normal. Although several multivariate statistical techniques focus on multimode fault diagnosis, those methods usually identify modes and then locally diagnose faults while ignoring relative information across modes and data imbalance problems. In this paper, a deep learning-based method combining Multi-gate Mixture-of-Experts (MMOE) and Synthetic Minority Over-sampling Technique (SMOTE) is proposed to address multimode imbalance fault diagnosis. Specifically, MMOE can identify modes and diagnose faults in each mode simultaneously. Furthermore, it investigates the common information of multiple modes by sharing …"}, "filled": true, "author_pub_id": "qG5_O40AAAAJ:2osOgNQ5qMEC", "num_citations": 9, "citedby_url": "/scholar?hl=en&cites=16375166107410205458", "cites_id": ["16375166107410205458"], "pub_url": "https://ieeexplore.ieee.org/abstract/document/10152774/", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:EoszutBGQOMJ:scholar.google.com/", "cites_per_year": {"2023": 1, "2024": 2, "2025": 4, "2026": 1}}, "qG5_O40AAAAJ:UebtZRa9Y70C": {"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "Invisible Backdoor Attack against Self-supervised Learning", "pub_year": 2024, "citation": "Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern …, 2024", "author": "Hanrong Zhang and Zhenting Wang and Tingxu Han and Mingyu Jin and Chenlu Zhan and Mengnan Du and Hongwei Wang and Shiqing Ma", "journal": "Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025.", "abstract": "Self-supervised learning (SSL) models are vulnerable to backdoor attacks. Existing backdoor attacks that are effective in SSL often involve noticeable triggers, like colored patches or visible noise, which are vulnerable to human inspection. This paper proposes an imperceptible and effective backdoor attack against self-supervised models. We first find that existing imperceptible triggers designed for supervised learning are less effective in compromising self-supervised models. We then identify this ineffectiveness is attributed to the overlap in distributions between the backdoor and augmented samples used in SSL. Building on this insight, we design an attack using optimized triggers disentangled with the augmented transformation in the SSL, while remaining imperceptible to human vision. Experiments on five datasets and six SSL algorithms demonstrate our attack is highly effective and stealthy. It also has strong resistance to existing backdoor defenses. Our code can be found at https://github. com/Zhang-Henry/INACTIVE."}, "filled": true, "author_pub_id": "qG5_O40AAAAJ:UebtZRa9Y70C", "num_citations": 5, "citedby_url": "/scholar?hl=en&cites=9137381198975711736,4604946956706669166", "cites_id": ["9137381198975711736", "4604946956706669166"], "pub_url": "https://openaccess.thecvf.com/content/CVPR2025/html/Zhang_Invisible_Backdoor_Attack_against_Self-supervised_Learning_CVPR_2025_paper.html", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:-LlH3sl_zn4J:scholar.google.com/", "cites_per_year": {"2024": 1, "2025": 2, "2026": 2}}, "qG5_O40AAAAJ:Y0pCki6q_DkC": {"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "From Uncertainty to Clarity: Uncertainty-Guided Class-Incremental Learning for Limited Biomedical Samples via Semantic Expansion", "pub_year": 2024, "citation": "(*Equal Contribution) arXiv preprint arXiv:2409.07757, 2024", "author": "Yifei Yao* and Hanrong Zhang*", "journal": "(*Equal Contribution) arXiv preprint arXiv:2409.07757", "abstract": "In real-world clinical settings, data distributions evolve over time, with a continuous influx of new, limited disease cases. Therefore, class incremental learning is of great significance, i.e., deep learning models are required to learn new class knowledge while maintaining accurate recognition of previous diseases. However, traditional deep neural networks often suffer from severe forgetting of prior knowledge when adapting to new data unless trained from scratch, which undesirably costs much time and computational burden. Additionally, the sample sizes for different diseases can be highly imbalanced, with newly emerging diseases typically having much fewer instances, consequently causing the classification bias. To tackle these challenges, we are the first to propose a class-incremental learning method under limited samples in the biomedical field. First, we propose a novel cumulative entropy prediction module to measure the uncertainty of the samples, of which the most uncertain samples are stored in a memory bank as exemplars for the model's later review. Furthermore, we theoretically demonstrate its effectiveness in measuring uncertainty. Second, we developed a fine-grained semantic expansion module through various augmentations, leading to more compact distributions within the feature space and creating sufficient room for generalization to new classes. Besides, a cosine classifier is utilized to mitigate classification bias caused by imbalanced datasets. Across four imbalanced data distributions over two datasets, our method achieves optimal performance, surpassing state-of-the-art methods by as much as 53.54% in accuracy."}, "filled": true, "author_pub_id": "qG5_O40AAAAJ:Y0pCki6q_DkC", "num_citations": 2, "citedby_url": "/scholar?hl=en&cites=16745201809494077395", "cites_id": ["16745201809494077395"], "pub_url": "https://arxiv.org/abs/2409.07757", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:028fa1PoYugJ:scholar.google.com/", "cites_per_year": {"2025": 2}}, "qG5_O40AAAAJ:u5HHmVD_uO8C": {"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "An intelligent system for semantic information extraction and knowledge graph construction from multi-type data sources", "pub_year": 2022, "citation": "2022 IEEE International Conference on e-Business Engineering (ICEBE), 163-170, 2022", "author": "Hanrong Zhang and Xinyue Wang and Bo Qin and Hongwei Wang", "conference": "2022 IEEE International Conference on e-Business Engineering (ICEBE)", "pages": "163-170", "publisher": "IEEE", "abstract": "Knowledge graph technology has been widely used in various fields and numerous platforms provides the knowledge-graph-based applications. Nevertheless, most of the applications require users to master expertise and programming ability. In this paper, a knowledge graph construction and application platform for general fields is completed in the web application form, which is user-friendly and interactive. Primarily, it can construct knowledge graphs of various fields automatically or semi-automatically from multiple types of data sources, including structured and unstructured data. Additionally, it can store, manage and update multiple versions of knowledge graphs by graph database Neo4j, and visualize specific information about each node and relationship of the knowledge graph. Finally, the system establishes a semantic parsing-based knowledge base Question Answering(KBQA) system based on the user …"}, "filled": true, "author_pub_id": "qG5_O40AAAAJ:u5HHmVD_uO8C", "num_citations": 2, "citedby_url": "/scholar?hl=en&cites=9563672380899512804", "cites_id": ["9563672380899512804"], "pub_url": "https://ieeexplore.ieee.org/abstract/document/10035077/", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:5NG6I1z9uIQJ:scholar.google.com/", "cites_per_year": {"2024": 1, "2025": 1}}, "qG5_O40AAAAJ:aqlVkmm33-oC": {"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "Rethinking Memory Mechanisms of Foundation Agents in the Second Half", "pub_year": 2026, "citation": "arXiv preprint arXiv:2602.06052, 2026", "author": "Wei-Chieh Huang and Weizhi Zhang and Yueqing Liang and Yuanchen Bei and Yankai Chen and Tao Feng and Xinyu Pan and Zhen Tan and Yu Wang and Tianxin Wei and Shanglin Wu and Ruiyao Xu and Liangwei Yang and Rui Yang and Wooseong Yang and Chin-Yuan Yeh and Hanrong Zhang and Haozhen Zhang and Siqi Zhu and Henry Peng Zou and Wanjia Zhao and Song Wang and Wujiang Xu and Zixuan Ke and Zheng Hui and Dawei Li and Yaozu Wu and Langzhou He and Chen Wang and Xiongxiao Xu and Baixiang Huang and Juntao Tan and Shelby Heinecke and Huan Wang and Caiming Xiong and Ahmed A Metwally and Jun Yan and Chen-Yu Lee and Hanqing Zeng and Yinglong Xia and Xiaokai Wei and Ali Payani and Haitong Ma and Wenya Wang and Chengguang Wang and Yu Zhang and Xin Wang and Yongfeng Zhang and Jiaxuan You and Hanghang Tong and Xiao Luo and Yizhou Sun and Wei Wang and Julian McAuley and James Zou and Jiawei Han and Philip S Yu and Kai Shu", "journal": "arXiv preprint arXiv:2602.06052", "abstract": "The research of artificial intelligence is undergoing a paradigm shift from prioritizing model innovations over benchmark scores towards emphasizing problem definition and rigorous real-world evaluation. As the field enters the \"second half,\" the central challenge becomes real utility in long-horizon, dynamic, and user-dependent environments, where agents face context explosion and must continuously accumulate, manage, and selectively reuse large volumes of information across extended interactions. Memory, with hundreds of papers released this year, therefore emerges as the critical solution to fill the utility gap. In this survey, we provide a unified view of foundation agent memory along three dimensions: memory substrate (internal and external), cognitive mechanism (episodic, semantic, sensory, working, and procedural), and memory subject (agent- and user-centric). We then analyze how memory is instantiated and operated under different agent topologies and highlight learning policies over memory operations. Finally, we review evaluation benchmarks and metrics for assessing memory utility, and outline various open challenges and future directions."}, "filled": true, "author_pub_id": "qG5_O40AAAAJ:aqlVkmm33-oC", "num_citations": 0, "pub_url": "https://arxiv.org/abs/2602.06052", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:VEPdK7hSlv8J:scholar.google.com/", "cites_per_year": {}}, "qG5_O40AAAAJ:M3ejUd6NZC8C": {"container_type": "Publication", "source": "AUTHOR_PUBLICATION_ENTRY", "bib": {"title": "Industrial Data Synthesis Framework for Fault Diagnosis Using Diffusion and Flow-Based Models", "pub_year": 2025, "citation": "2025 28th International Conference on Computer Supported Cooperative Work in …, 2025", "author": "Shuting Tao and Xiangming Meng and Hanrong Zhang and Hongwei Wang", "conference": "2025 28th International Conference on Computer Supported Cooperative Work in Design (CSCWD)", "pages": "1214-1219", "publisher": "IEEE", "abstract": "Fault diagnosis plays a significant role in the intelligent maintenance of industrial processes. Although there are numerous deep learning methods designed for fault diagnosis, certain challenges remain difficult to address in real-world industrial scenarios. These challenges include ensuring high- precision fault detection while maintaining industrial privacy in the presence of sensitive data, as well as achieving accurate detection when fault samples are limited. This paper proposes an industrial data generation framework using diffusion and flow- based models. The proposed approach learns the distribution of the original data to generate synthetic samples with similar characteristics, effectively resolving the dual challenges of data sensitivity and scarcity. Experiments on the Tennessee Eastman dataset demonstrate that our approach outperforms existing methods in fault diagnosis performance."}, "filled": true, "author_pub_id": "qG5_O40AAAAJ:M3ejUd6NZC8C", "num_citations": 0, "pub_url": "https://ieeexplore.ieee.org/abstract/document/11033333/", "url_related_articles": "/scholar?oi=bibs&hl=en&q=related:yityRI_EYtkJ:scholar.google.com/", "cites_per_year": {}}}, "citedby5y": 237, "hindex": 7, "hindex5y": 7, "i10index": 6, "i10index5y": 6, "cites_per_year": {"2023": 6, "2024": 40, "2025": 147, "2026": 44}, "updated": "2026-02-27 17:31:50.433436"}